# populate_fences.py
from tareeqy.models import Fence

fence_names = [
    "صره", "دير شرف", "عين سينيا", "روابي", "جبع", "شافي شمرون", "المربعه","جبارة", 
     "بوابة بورين", "عورتا", "بزاريا",  
    "الحمرا", "العيزرية", "عناتا", "الكونتينر", "يتسهار", "زعترة", "الفندق", "النبي يونس",
      "سلفيت", "ترمسعيا", "العبيدية", 
    "قلنديا",  "الزعيم",  "النشاش", "بيت جالا", "النفق",  "الحضر", 
     "عين سينا", "حواره", "البادان",
     "النبي صالح", "بيت ليد", "اريحا",  "كفر لاقف", 
      "حارس", "كانا", "بديا",  "جماعين", "عقربا", 
]

for name in fence_names:
    Fence.objects.get_or_create(name=name)

print("Fences have been added to the database.")